In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

**SERIES**

In [4]:
serie = pd.Series([55,23,678,453,45,63,937])
serie

0     55
1     23
2    678
3    453
4     45
5     63
6    937
dtype: int64

In [5]:
serie.values

array([ 55,  23, 678, 453,  45,  63, 937])

In [6]:
serie.index

RangeIndex(start=0, stop=7, step=1)

In [7]:
fruits = pd.Series([21, 24, 65, 78], 
    index=['apple','orange','banana','watermelon'])

fruits

apple         21
orange        24
banana        65
watermelon    78
dtype: int64

In [8]:
fruits['banana']

65

In [9]:
fruits[3]

78

In [11]:
fruits.name = 'serie'
fruits.index.name = 'pear'
fruits

pear
apple         21
orange        24
banana        65
watermelon    78
Name: serie, dtype: int64

In [12]:
np.log(fruits)

pear
apple         3.044522
orange        3.178054
banana        4.174387
watermelon    4.356709
Name: serie, dtype: float64

In [17]:
fruits[fruits>40]

pear
banana        65
watermelon    78
Name: serie, dtype: int64

In [18]:
fruits_dict = {'apple': 29, 'orange': 45, 'pear': 34, 'watermelon': 456}
print(fruits_dict)
pd.Series(fruits_dict)

{'apple': 29, 'orange': 45, 'pear': 34, 'watermelon': 456}

apple          29
orange         45
pear           34
watermelon    456
dtype: int64

**DATAFRAME**

In [20]:
details = {"name": ["Aiden", "Emma", "Reuben", "Akhil", "Ethan"],
        "reg_no": [20, 19, 38, 1, 22],
        "STD": [4, 8, 5, 3, 7]}
print(details)
details = pd.DataFrame(details)
details

{'name': ['Aiden', 'Emma', 'Reuben', 'Akhil', 'Ethan'], 'reg_no': [20, 19, 38, 1, 22], 'STD': [4, 8, 5, 3, 7]}

     name  reg_no  STD
0   Aiden      20    4
1    Emma      19    8
2  Reuben      38    5
3   Akhil       1    3
4   Ethan      22    7

In [22]:
df = pd.DataFrame(details, columns=["name", "STD" ,"reg_no"])
df

     name  STD  reg_no
0   Aiden    4      20
1    Emma    8      19
2  Reuben    5      38
3   Akhil    3       1
4   Ethan    7      22

In [23]:
df['nonsense'] = df.reg_no / df.STD
df

     name  STD  reg_no  nonsense
0   Aiden    4      20  5.000000
1    Emma    8      19  2.375000
2  Reuben    5      38  7.600000
3   Akhil    3       1  0.333333
4   Ethan    7      22  3.142857

In [24]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

     name  STD  reg_no  nonsense  Serie_aligned
0   Aiden    4      20  5.000000              0
1    Emma    8      19  2.375000              1
2  Reuben    5      38  7.600000              2
3   Akhil    3       1  0.333333              3
4   Ethan    7      22  3.142857              4

In [25]:
df.to_dict()

{'STD': {0: 4, 1: 8, 2: 5, 3: 3, 4: 7},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4},
 'name': {0: 'Aiden', 1: 'Emma', 2: 'Reuben', 3: 'Akhil', 4: 'Ethan'},
 'nonsense': {0: 5.0,
  1: 2.375,
  2: 7.6,
  3: 0.3333333333333333,
  4: 3.142857142857143},
 'reg_no': {0: 20, 1: 19, 2: 38, 3: 1, 4: 22}}

In [26]:
pd.DataFrame(df.to_dict())

     name  STD  reg_no  nonsense  Serie_aligned
0   Aiden    4      20  5.000000              0
1    Emma    8      19  2.375000              1
2  Reuben    5      38  7.600000              2
3   Akhil    3       1  0.333333              3
4   Ethan    7      22  3.142857              4

In [28]:
details = [{'a': i, 'b':10* i}for i in range(10)]
print(details)
pd.DataFrame(details)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}, {'a': 6, 'b': 60}, {'a': 7, 'b': 70}, {'a': 8, 'b': 80}, {'a': 9, 'b': 90}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50
6  6  60
7  7  70
8  8  80
9  9  90

In [29]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [30]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    9    9
b    9    9
c    9    9